Public Attributes | List of all members
API_StairPolylineData Struct Reference
Element Manager API
Represents a Stair polyline (baseline or walking line). More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Polygon  | polygon
The API polygon element describing the amounts of vertices in the boundary line.
API_Coord **  | coords
The coordinates of the vertices of the boundary line.
Int32 **  | pends
The polygon endings of the boundary line.
API_PolyArc **  | parcs
The arcs of the boundary line.
API_StairPolylineEdgeData *  | edgeData
The edge data of each edge.
API_StairPolylineVertexData *  | vertexData
The vertex data of each vertex.
Detailed Description
Represents a Stair polyline (baseline or walking line).
Remarks
There are two Stair polylines in the API_StairType structure, the baseline and the walking line.
Member Data Documentation
◆ coords
 API_StairPolylineData::coords
The coordinates of the vertices of the boundary line.
◆ edgeData
 API_StairPolylineData::edgeData
The edge data of each edge.
◆ parcs
 API_StairPolylineData::parcs
The arcs of the boundary line.
◆ pends
 API_StairPolylineData::pends
The polygon endings of the boundary line.
◆ polygon
 API_StairPolylineData::polygon
The API polygon element describing the amounts of vertices in the boundary line.
◆ vertexData
 API_StairPolylineData::vertexData
The vertex data of each vertex.